@echo off
title Hexo 博客双向同步工具
color 0b

echo ======================================================
echo           1. 正在同步 Qexo 的远程改动 (Master)
echo ======================================================
git pull origin master

echo.
echo ======================================================
echo           2. 正在备份源码到 GitHub (Master)
echo ======================================================
git add .
git commit -m "Site Update: %date% %time%"
git push origin master

echo.
echo ======================================================
echo           3. 正在编译并发布网页 (Main)
echo ======================================================
call hexo clean
call hexo g
call hexo d

echo.
echo ======================================================
echo           任务完成！源码已备份，网页已发布。
echo ======================================================
pause